[
  {
    "title": "Plumbing Apprentice",
    "company": "Canyon Plumbing & Heating Ltd",
    "location": "Beltline, Calgary, AB",
    "description": "Assist with plumbing installations and repairs under guidance. Gain hands-on experience in residential projects.",
    "details": "This position is for those seeking to learn the basics of plumbing with semi-supervised work to ensure quality. Ideal for candidates interested in a long-term career in plumbing.",
    "noKeywords": ["plumbing_skills", "construction_skills", "physical_labour"]
  },
  {
    "title": "Landscaping Assistant",
    "company": "GreenScape Landscaping",
    "location": "Bridgeland, Calgary, AB",
    "description": "Work on sustainable landscaping projects with a focus on eco-friendly practices. Learn plant care and outdoor design.",
    "details": "The role includes basic landscaping tasks with a focus on sustainable practices. Ideal for those with a passion for outdoor work and environmental conservation.",
    "noKeywords": ["agricultural_skills", "construction_skills", "physical_labour"]
  },
  {
    "title": "Electrician Apprentice",
    "company": "Volt Pro Electrical",
    "location": "Inglewood, Calgary, AB",
    "description": "Assist in electrical installations and repairs with experienced professionals. Hands-on experience in residential and commercial projects.",
    "details": "Ideal for beginners looking to understand electrical basics. Supervised training will ensure safety and skill development for those interested in a career as an electrician.",
    "noKeywords": ["electrical_skills", "technical_skills", "construction_skills"]
  },
  {
    "title": "Construction Helper",
    "company": "BuildRight Construction",
    "location": "Kensington, Calgary, AB",
    "description": "Support various construction projects, from residential to commercial. Work alongside experienced builders to gain foundational construction skills.",
    "details": "This role focuses on basic construction skills, safety protocols, and teamwork, providing essential experience for anyone pursuing a construction career.",
    "noKeywords": ["construction_skills", "physical_labour", "mechanical_skills"]
  },
  {
    "title": "HVAC Technician Assistant",
    "company": "Cool Breeze HVAC Services",
    "location": "Forest Lawn, Calgary, AB",
    "description": "Learn HVAC installation and maintenance basics. Work with seasoned technicians to gain experience in heating and cooling systems.",
    "details": "A great opportunity to understand the fundamentals of HVAC systems, including maintenance and repair. Perfect for those considering HVAC as a career path.",
    "noKeywords": ["mechanical_skills", "technical_skills", "electrical_skills"]
  },
  {
    "title": "Painter Assistant",
    "company": "Prime Coat Painters",
    "location": "Mission, Calgary, AB",
    "description": "Assist in interior and exterior painting projects with a focus on technique and quality. Hands-on experience in both residential and commercial settings.",
    "details": "Get trained in various painting techniques and gain real-world experience. Ideal for those interested in pursuing professional painting.",
    "noKeywords": ["craftsmanship", "construction_skills", "physical_labour"]
  },
  {
    "title": "Carpentry Apprentice",
    "company": "WoodWorks Carpentry",
    "location": "Eau Claire, Calgary, AB",
    "description": "Learn carpentry basics, from framing to finishing. Work alongside master carpenters to gain practical skills in woodworking.",
    "details": "This role provides hands-on experience in carpentry with a focus on craftsmanship and attention to detail. Suitable for those considering a long-term career in carpentry.",
    "noKeywords": ["craftsmanship", "construction_skills", "physical_labour"]
  },
  {
    "title": "Gardening Assistant",
    "company": "Green Thumb Gardens",
    "location": "Altadore, Calgary, AB",
    "description": "Assist with garden maintenance and plant care. Work with horticulture experts to learn about plant health and sustainable gardening.",
    "details": "Gain practical experience in gardening, from plant selection to soil care. Ideal for individuals interested in landscape gardening or horticulture.",
    "noKeywords": ["agricultural_skills", "physical_labour", "construction_skills"]
  },
  {
    "title": "Flooring Installer Assistant",
    "company": "Floor Masters Ltd",
    "location": "Sunnyside, Calgary, AB",
    "description": "Assist with flooring installations, including hardwood, laminate, and tile. Work under supervision to develop technical skills.",
    "details": "Learn installation techniques and gain experience in flooring projects. Great for those looking to develop skills in a growing industry.",
    "noKeywords": ["construction_skills", "technical_skills", "physical_labour"]
  },
  {
    "title": "Welder Assistant",
    "company": "SteelCraft Welding Co",
    "location": "Ramsay, Calgary, AB",
    "description": "Support welding projects in a safe, supervised environment. Work on both small and large-scale projects to gain practical welding experience.",
    "details": "Perfect for those interested in learning welding techniques, safety, and craftsmanship. Ideal for individuals considering a career in metalwork.",
    "noKeywords": ["technical_skills", "mechanical_skills", "craftsmanship"]
  },
  {
    "title": "HVAC Install Assistant",
    "company": "Climate Comfort Solutions",
    "location": "Hillhurst, Calgary, AB",
    "description": "Work with an experienced HVAC team on installations and troubleshooting. Gain hands-on experience in heating and cooling systems.",
    "details": "This role focuses on HVAC installation basics, providing essential experience for those interested in HVAC and climate control systems.",
    "noKeywords": ["electrical_skills", "mechanical_skills", "technical_skills"]
  },
  {
    "title": "Masonry Apprentice",
    "company": "StoneWorks Masonry",
    "location": "Downtown West End, Calgary, AB",
    "description": "Learn foundational masonry skills, including bricklaying and stonework. Work under a master mason to develop skills in construction.",
    "details": "Ideal for beginners interested in masonry. The role focuses on building and construction techniques for residential and commercial projects.",
    "noKeywords": ["construction_skills", "craftsmanship", "physical_labour"]
  }
]
